"use strict";

/*
Angular.js
Самый сложный фреймворк из наиболее популярных.

Нужно выучить
1. node.js
2. typescript
3. webpack
4. MVC pattern
5. Angular docs

React
Наиболее популярный и легкий для вхождения инструмент

Нужно выучить
1. Препроцессор JSX
2. Babel jsx компилируется при помощи бэбеля
3. Webpack
4. React docs
5. Самое большое комьюнити

Vue.js
Наиболее молодой инструмент наиболее ярковыраженный компонентный подход,
так же имеет не большой порог вхождения.

1. JavaScript
2. Webpack
3. Vue.js
*/